## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 38 to add, 0 to change, 14 to destroy.</code></pre>

* Create
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-ap-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-ap-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-ap-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-bl-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-bl-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-bl-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-joh-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-joh-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-joh-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-td-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-td-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-td-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-ap-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-ap-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-ap-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-bl-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-bl-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-bl-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-joh-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-joh-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-joh-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-td-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-td-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-td-pub&#34;]
* Replace
  * azurerm_linux_function_app.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-ap-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-ap-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-ap-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-ap-dl-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-ap-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-ap-pub-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-bl-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-bl-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-bl-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-bl-dl-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-bl-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-bl-pub-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-joh-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-joh-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-joh-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-joh-dl-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-joh-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-joh-pub-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-td-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-td-ack-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-td-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-td-dl-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-td-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-td-pub-00-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest00-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest00-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-ap-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-ap-ack-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest02-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest02-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-ap-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-ap-dl-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest02-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest02-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-ap-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-ap-pub-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest02-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest02-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-bl-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-bl-ack-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest02-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest02-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-bl-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-bl-dl-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest02-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest02-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-bl-pub"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-bl-pub-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest02-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest02-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-joh-ack"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-joh-ack-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria_manage_sas"
      + namespace_name                    = "ingest02-integration-eventHubNamespace001-sbox"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest02-main-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["02-joh-dl"] will be created
  + resource "azurerm_eventhub_authorization_rule" "aria_topic_sas" {
      + eventhub_name                     = "evh-joh-dl-02-uks-dlrm-01"
      + id                                = (known after apply)
      + listen               

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

2-main-sbox/providers/Microsoft.Web/sites/02-af-bails-sbox-uks-dlrm-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
      ~ name                                           = "02-af-bails-sbox-uks-dlrm-01" -> "af-bails-sbox-uks-dlrm-01" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.90.134.28" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.49.241.240",
          - "20.49.242.29",
          - "20.49.242.61",
          - "20.49.242.68",
          - "20.49.242.92",
          - "20.49.242.171",
          - "20.49.174.115",
          - "20.49.174.138",
          - "20.49.174.159",
          - "20.49.174.164",
          - "20.49.174.187",
          - "20.49.175.107",
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.49.241.62",
          - "20.49.241.70",
          - "20.49.241.88",
          - "20.49.241.216",
          - "20.49.241.223",
          - "20.49.241.234",
          - "20.49.243.58",
          - "20.49.243.61",
          - "20.49.243.176",
          - "20.49.243.182",
          - "20.49.243.196",
          - "20.49.243.199",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      + zip_deploy_file                                = (known after apply)
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ app_scale_limit                               = 0 -> (known after apply)
          - application_insights_connection_string        = (sensitive value) -> null
          ~ default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled                = false -> (known after apply)
          ~ elastic_instance_minimum                      = 1 -> (known after apply)
          - health_check_eviction_time_in_min             = 0 -> null
          ~ linux_fx_version                              = "PYTHON|3.10" -> (known after apply)
          ~ pre_warmed_instance_count                     = 0 -> (known after apply)
          + remote_debugging_version                      = (known after apply)
          - runtime_scale_monitoring_enabled              = false -> null
          ~ scm_type                                      = "None" -> (known after apply)
          ~ worker_count                                  = 1 -> (known after apply)
            # (21 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (6 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_function_app.example["02-af-joh-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "02-af-joh-sbox-uks-dlrm-01.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-joh-sbox-uks-dlrm-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
      ~ name                                           = "02-af-joh-sbox-uks-dlrm-01" -> "af-joh-sbox-uks-dlrm-01" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.90.134.28" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.49.241.240",
          - "20.49.242.29",
          - "20.49.242.61",
          - "20.49.242.68",
          - "20.49.242.92",
          - "20.49.242.171",
          - "20.49.174.115",
          - "20.49.174.138",
          - "20.49.174.159",
          - "20.49.174.164",
          - "20.49.174.187",
          - "20.49.175.107",
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.49.241.62",
          - "20.49.241.70",
          - "20.49.241.88",
          - "20.49.241.216",
          - "20.49.241.223",
          - "20.49.241.234",
          - "20.49.243.58",
          - "20.49.243.61",
          - "20.49.243.176",
          - "20.49.243.182",
          - "20.49.243.196",
          - "20.49.243.199",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      + zip_deploy_file                                = (known after apply)
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ app_scale_limit                               = 0 -> (known after apply)
          - application_insights_connection_string        = (sensitive value) -> null
          ~ default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled                = false -> (known after apply)
          ~ elastic_instance_minimum                      = 1 -> (known after apply)
          - health_check_eviction_time_in_min             = 0 -> null
          ~ linux_fx_version                              = "PYTHON|3.10" -> (known after apply)
          ~ pre_warmed_instance_count                     = 0 -> (known after apply)
          + remote_debugging_version                      = (known after apply)
          - runtime_scale_monitoring_enabled              = false -> null
          ~ scm_type                                      = "None" -> (known after apply)
          ~ worker_count                                  = 1 -> (known after apply)
            # (21 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (6 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_function_app.example["02-af-sbails-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "02-af-sbails-sbox-uks-dlrm-01.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-sbails-sbox-uks-dlrm-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
      ~ name                                           = "02-af-sbails-sbox-uks-dlrm-01" -> "af-sbails-sbox-uks-dlrm-01" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.90.134.28" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.49.241.240",
          - "20.49.242.29",
          - "20.49.242.61",
          - "20.49.242.68",
          - "20.49.242.92",
          - "20.49.242.171",
          - "20.49.174.115",
          - "20.49.174.138",
          - "20.49.174.159",
          - "20.49.174.164",
          - "20.49.174.187",
          - "20.49.175.107",
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.49.241.62",
          - "20.49.241.70",
          - "20.49.241.88",
          - "20.49.241.216",
          - "20.49.241.223",
          - "20.49.241.234",
          - "20.49.243.58",
          - "20.49.243.61",
          - "20.49.243.176",
          - "20.49.243.182",
          - "20.49.243.196",
          - "20.49.243.199",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      + zip_deploy_file                                = (known after apply)
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ app_scale_limit                               = 0 -> (known after apply)
          - application_insights_connection_string        = (sensitive value) -> null
          ~ default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled                = false -> (known after apply)
          ~ elastic_instance_minimum                      = 1 -> (known after apply)
          - health_check_eviction_time_in_min             = 0 -> null
          ~ linux_fx_version                              = "PYTHON|3.10" -> (known after apply)
          ~ pre_warmed_instance_count                     = 0 -> (known after apply)
          + remote_debugging_version                      = (known after apply)
          - runtime_scale_monitoring_enabled              = false -> null
          ~ scm_type                                      = "None" -> (known after apply)
          ~ worker_count                                  = 1 -> (known after apply)
            # (21 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (6 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_function_app.example["02-af-td-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "02-af-td-sbox-uks-dlrm-01.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/02-af-td-sbox-uks-dlrm-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
      ~ name                                           = "02-af-td-sbox-uks-dlrm-01" -> "af-td-sbox-uks-dlrm-01" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.90.134.28" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.49.241.240",
          - "20.49.242.29",
          - "20.49.242.61",
          - "20.49.242.68",
          - "20.49.242.92",
          - "20.49.242.171",
          - "20.49.174.115",
          - "20.49.174.138",
          - "20.49.174.159",
          - "20.49.174.164",
          - "20.49.174.187",
          - "20.49.175.107",
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.49.241.62",
          - "20.49.241.70",
          - "20.49.241.88",
          - "20.49.241.216",
          - "20.49.241.223",
          - "20.49.241.234",
          - "20.49.243.58",
          - "20.49.243.61",
          - "20.49.243.176",
          - "20.49.243.182",
          - "20.49.243.196",
          - "20.49.243.199",
          - "20.90.134.28",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      + zip_deploy_file                                = (known after apply)
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ app_scale_limit                               = 0 -> (known after apply)
          - application_insights_connection_string        = (sensitive value) -> null
          ~ default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled                = false -> (known after apply)
          ~ elastic_instance_minimum                      = 1 -> (known after apply)
          - health_check_eviction_time_in_min             = 0 -> null
          ~ linux_fx_version                              = "PYTHON|3.10" -> (known after apply)
          ~ pre_warmed_instance_count                     = 0 -> (known after apply)
          + remote_debugging_version                      = (known after apply)
          - runtime_scale_monitoring_enabled              = false -> null
          ~ scm_type                                      = "None" -> (known after apply)
          ~ worker_count                                  = 1 -> (known after apply)
            # (21 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (6 unchanged attributes hidden)
            }
        }
    }

Plan: 38 to add, 0 to change, 14 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->